{
  "backend/main.mo": "Motoko backend actor managing notes, events, and settings with per-user maps and authorization checks.",
  "feature_evidence.json": "Feature evidence metadata mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries for many frontend files including hooks, services, components, and utilities.",
  "frontend/IMPLEMENTATION_PLAN.md": "Implementation plan describing architecture, features, milestones, and required backend/frontend components.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global base styles.",
  "frontend/index.html": "Basic HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router routes wrapped in theme provider and AuthGate-protected pages.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with header, navigation, footer, and principal display using auth state.",
  "frontend/src/components/layout/PrimaryNav.tsx": "Navigation bar component rendering route buttons with active state tracking.",
  "frontend/src/core/crypto/encryptionService.ts": "Provides AES-GCM encryption/decryption with key generation, storage in localStorage, and reset utilities.",
  "frontend/src/core/errors/formatError.ts": "Maps common error message patterns to user-friendly strings with fallbacks.",
  "frontend/src/core/query/queryKeys.ts": "Defines structured React Query keys for notes, events, and settings.",
  "frontend/src/features/auth/components/AuthGate.tsx": "Wraps content with authentication checks and shows login UI or loading state.",
  "frontend/src/features/auth/components/LoginButton.tsx": "Renders a sign-in/out button and handles login/logout logic with fallback handling.",
  "frontend/src/features/auth/hooks/useAuth.ts": "Exposes authentication state and actions using Internet Identity and clears queries on logout.",
  "frontend/src/features/auth/index.ts": "Re-exports auth components, hooks, and utilities.",
  "frontend/src/features/auth/utils/principalDisplay.ts": "Shortens long principal IDs for display.",
  "frontend/src/features/calendar/components/DailyAgenda.tsx": "Displays daily events with times, details, loading state, and delete actions.",
  "frontend/src/features/calendar/components/EventForm.tsx": "Form for creating events with optional prefill and time handling.",
  "frontend/src/features/calendar/components/MonthCalendar.tsx": "Renders a month grid with navigation, selected state, and event indicators.",
  "frontend/src/features/calendar/hooks/useCalendarQueries.ts": "Provides calendar-related React Query hooks for fetching, creating, and deleting events.",
  "frontend/src/features/calendar/index.ts": "Exports calendar page and related hooks.",
  "frontend/src/features/calendar/pages/CalendarPage.tsx": "Full calendar page combining month view, daily agenda, and event creation with error handling.",
  "frontend/src/features/calendar/services/calendarService.ts": "Wraps backend actor calls for creating, deleting, and fetching events for a day.",
  "frontend/src/features/dashboard/pages/DashboardPage.tsx": "Displays recent notes and today's events with navigation and loading states.",
  "frontend/src/features/notes/components/NoteEditor.tsx": "Provides a note editing UI with optional event creation based on extracted date/time suggestions.",
  "frontend/src/features/notes/components/NotesList.tsx": "Renders a list of notes with selection, deletion, and loading placeholders.",
  "frontend/src/features/notes/hooks/useDateTimeSuggestion.ts": "Debounces note text and extracts date/time suggestions using a parser.",
  "frontend/src/features/notes/hooks/useNotesQueries.ts": "Defines React Query hooks for listing, fetching, creating, updating, and deleting notes via NotesService.",
  "frontend/src/features/notes/index.ts": "Re-exports NotesPage, note query hooks, and note-related types.",
  "frontend/src/features/notes/nlp/dateTimeExtractor.ts": "Parses text for dates and times in various formats and returns a confidence-scored suggestion.",
  "frontend/src/features/notes/pages/NotesPage.tsx": "Implements the main notes page with note selection, creation, editing, deletion, and event creation from notes.",
  "frontend/src/features/notes/services/notesService.ts": "Handles note CRUD operations and encrypts/decrypts private note content using the backend actor and encryption service.",
  "frontend/src/features/notes/types.ts": "Defines note view model plus input types for creating and updating notes.",
  "frontend/src/features/settings/components/EncryptionKeyPanel.tsx": "UI panel for viewing, generating, and resetting the local encryption key with related status and dialogs.",
  "frontend/src/features/settings/components/UiPreferencesPanel.tsx": "Provides a UI for toggling dark mode using theme state.",
  "frontend/src/features/settings/hooks/useSettingsQueries.ts": "Defines React Query hooks for fetching and saving user settings through the SettingsService.",
  "frontend/src/features/settings/index.ts": "Re-exports settings page and settings-related hooks.",
  "frontend/src/features/settings/pages/SettingsPage.tsx": "Settings page layout containing encryption key and UI preference panels.",
  "frontend/src/features/settings/services/settingsService.ts": "Wraps backend settings operations and exposes encryption key utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/index.css": "Tailwind CSS base configuration defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's architecture, features, and design rules for a layered Flutter app with authentication, encryption, NLP, and calendar-related modules."
}